Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [6]:
import pandas as pd

In [7]:
pip install pandas

Requirement already satisfied: pandas in /opt/conda/lib/python3.10/site-packages (1.5.2)
Requirement already satisfied: python-dateutil>=2.8.1 in /opt/conda/lib/python3.10/site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /opt/conda/lib/python3.10/site-packages (from pandas) (2022.6)
Requirement already satisfied: numpy>=1.21.0 in /opt/conda/lib/python3.10/site-packages (from pandas) (1.23.5)
Requirement already satisfied: six>=1.5 in /opt/conda/lib/python3.10/site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [3]:
data = [4,8,15,16,23,42]
ser = pd.Series(data)
print(ser)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [4]:
type(ser)

pandas.core.series.Series

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [6]:
list = [1,3,23.43,"shivam", 20 , "prachi", "akash" , 3.54, "kavita" , "bhanu"]
var = pd.Series(list)
print(var)

0         1
1         3
2     23.43
3    shivam
4        20
5    prachi
6     akash
7      3.54
8    kavita
9     bhanu
dtype: object

Q3.

In [7]:
import csv

In [8]:
data=[["Name" , "Age" , "Gender"],
      ["Alice" , 25 , "female"],
      ["Bob" , 30 , "male"],
      ["claire", 27 , "female"]
]

In [9]:
with open("data.csv" , "w") as f:
    writer = csv.writer(f)
    
    for i in data:
        writer.writerow(i)

In [11]:
pd.read_csv("data.csv")

     Name  Age  Gender
0   Alice   25  female
1     Bob   30    male
2  claire   27  female

In [12]:
type(pd.read_csv("data.csv"))

pandas.core.frame.DataFrame

In [18]:
data={
    "name" : ["Alice" , "Bob", "claire"],
    "Age" : [25,30,27],
    "Gender" : ["female" , "male" , "female"]
    
}

df = pd.DataFrame(data)
print(df)

     name  Age  Gender
0   Alice   25  female
1     Bob   30    male
2  claire   27  female

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

DataFrame is two-dimensional size-mutable, potentially heterogeneous tabular data structure with labeled axes (rows and columns). A Data frame is a two-dimensional data structure, i.e., data is aligned in a tabular fashion in rows and columns. Pandas DataFrame consists of three principal components, the data, rows, and columns.

DataFrames can be used to represent the following table that has rows and columns.
EXAMPLE:-

In [19]:
df

     name  Age  Gender
0   Alice   25  female
1     Bob   30    male
2  claire   27  female

A Series is a data structure representing a single row or column of a DataFrame. EXAMPLE:-

In [20]:
df["name"]

0     Alice
1       Bob
2    claire
Name: name, dtype: object

In [21]:
type(df["name"])

pandas.core.series.Series

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

The data in the real world is very unpleasant & unordered so by performing certain operations we can make data understandable based on one’s requirements, this process of converting unordered data into meaningful information can be done by data manipulation.

WE ARE MANIPULATE DATA THROUGH CSV

In [23]:
import csv

In [24]:
data2=[["Name" , "Age" , "Gender", "email_id"],
      ["jorg" , 25 , "female" , "jorg@gmail.com"],
      ["Bob" , 30 , "male" , "bob@gmail.com"],
      ["charly", 27 , "female" , "charly@gmail.com"]
]

In [25]:
with open("data2.csv" , "w") as f:
    writer = csv.writer(f)
    
    for i in data:
        writer.writerow(i)

In [26]:
pd.read_csv("data2.csv")

     Name  Age  Gender          email_id
0    jorg   25  female    jorg@gmail.com
1     Bob   30    male     bob@gmail.com
2  charly   27  female  charly@gmail.com

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

DataFrame and Panel are Mutable in nature.

Pandas in Python deals with three data structures namely

Series, 
DataFrame, 
Panel,

Series in Pandas:- Series is a one-dimensional array with homogeneous data.  All the elements of series should be of same data type

Key Features of a Series:

1.Homogeneous data, 

2.size Immutable –size cannot be changed, 

3.Values of Data Mutable,

DataFrame in pandas:-- DataFrame is a two-dimensional array with heterogeneous data, usually represented in the tabular format. The data is represented in rows and columns. Each column represents an attribute and each row represents a person.

Key Features of a DataFrame:
    
1.Heterogeneous data

2.Size Mutable

3.Data Mutable

Panel in pandas:-- Panel is a three-dimensional data structure with heterogeneous data.

Key Features of a Panel:
    
1.Heterogeneous data

2.Size Mutable

3.Data Mutable

Q7. Create a DataFrame using multiple Series. Explain with an example.

In [30]:
product={
    "name" : ["skincare" , "hair" , "body"],
    "costprice" : [2200 , 2300 ,5000 ],
    "id_no" : [23 , 35 , 96],
    "mail_prod" : ["ski@gmail.com" , "hair@gmail.com" , "body@gmail.com"],
    "markedprice" : [25000 ,30000 , 75000 ]
    
}

df=pd.DataFrame(product)
print(df)

       name  costprice  id_no       mail_prod  markedprice
0  skincare       2200     23   ski@gmail.com        25000
1      hair       2300     35  hair@gmail.com        30000
2      body       5000     96  body@gmail.com        75000

In [31]:
df[["name" , "costprice" , "markedprice"]]

       name  costprice  markedprice
0  skincare       2200        25000
1      hair       2300        30000
2      body       5000        75000